TodoApp/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "walk the giraffe"], ["body", "walk giraffe NOW!"], ["done", false], ["created_at", "2021-10-21 19:44:38.645153"], ["updated_at", "2021-10-21 19:44:38.645153"]]
---
    def create
        # debugger
        todo = Todo.new(todo_params)
        if todo.save

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 3]]
---
    def destroy
        todo = Todo.find(params[:id])
        todo.destroy